; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument8 image1)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite1 Phenomenon10)
	(pointing satellite2 Planet11)
	(have_image Star5 image1)
	(have_image Planet6 image1)
	(have_image Phenomenon7 thermograph0)
	(have_image Star8 image1)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image1)
))

)

; plan
1. (turn_to satellite2 star2 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star2)
   goals met: 0 of 9
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 9
3. (calibrate satellite2 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 0 of 9
4. (turn_to satellite2 planet9 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet9)
   goals met: 0 of 9
5. (take_image satellite2 planet9 instrument5 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 1 of 9
6. (turn_to satellite2 planet6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet6)
   goals met: 1 of 9
7. (take_image satellite2 planet6 instrument5 image1)
   added: (have_image planet6 image1)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon7 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 9
9. (take_image satellite2 phenomenon7 instrument5 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 3 of 9
10. (turn_to satellite2 phenomenon10 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 9
11. (take_image satellite2 phenomenon10 instrument5 image1)
   added: (have_image phenomenon10 image1)
   goals met: 4 of 9
12. (turn_to satellite1 phenomenon10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 9
13. (turn_to satellite2 star5 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star5)
   goals met: 5 of 9
14. (take_image satellite2 star5 instrument5 image1)
   added: (have_image star5 image1)
   goals met: 6 of 9
15. (turn_to satellite2 star8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star8)
   goals met: 6 of 9
16. (take_image satellite2 star8 instrument5 image1)
   added: (have_image star8 image1)
   goals met: 7 of 9
17. (turn_to satellite2 planet11 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet11)
   goals met: 8 of 9
18. (take_image satellite2 planet11 instrument5 image1)
   added: (have_image planet11 image1)
   goals met: 9 of 9
